In [1]:
import numpy as np
import pandas as pd
from datetime import timedelta
import math

from dateutil.relativedelta import *
from datetime import date
from datetime import datetime
import fprocessamento as fprocess


def recortarCID(cidStr):
    strSeparada = cidStr.rsplit(":")
    if len(strSeparada) > 1:
        return strSeparada[0]
    else:
        return cidStr

In [2]:
#ISO-8859-1
nomeArquivoOrigemCID = 'datasets/origem/MPS/ACT07.csv'
nomeArquivoResultadoCID = 'datasets/result/dados_CID_MPS.csv'

columns_types = {'ano': str, 'motivo"': str, 'cid': str, 'qtde': str, 'situacao': str}

nomes  = ['ano', 'motivo', 'cid', 'qtde', 'situacao']

dados_originais = pd.read_csv(nomeArquivoOrigemCID, sep = ',', header=0, names=nomes, dtype=columns_types, encoding='ISO-8859-1')

df_original = pd.DataFrame(data = dados_originais, columns=nomes)
df_original.shape[0] #50518

50518

In [3]:
df_original.head()

,ano,motivo,cid,qtde,situacao
0,2000,Típico-Com Cat,998:Outros,47649,Com Cat Registrada
1,2000,Típico-Com Cat,999:Ignorado,38246,Com Cat Registrada
2,2000,Típico-Com Cat,S61:Ferim do Punho e da Mao,35606,Com Cat Registrada
3,2000,Típico-Com Cat,S62:Frat ao Nivel do Punho e da Mao,21042,Com Cat Registrada
4,2000,Típico-Com Cat,S60:Traum Superf do Punho e da Mao,9811,Com Cat Registrada

In [4]:
fprocess.formatarStr(df_original, ['ano', 'motivo', 'cid', 'qtde', 'situacao'])

selecaoRegistrados = df_original['situacao'] == 'Com Cat Registrada'
df_original = df_original[selecaoRegistrados]
df_original.shape[0] #39558

39558

In [5]:
df_original.drop(['motivo','situacao'], axis=1, inplace = True)
df_original.head()

    ano                                  cid   qtde
0  2000                           998:Outros  47649
1  2000                         999:Ignorado  38246
2  2000          S61:Ferim do Punho e da Mao  35606
3  2000  S62:Frat ao Nivel do Punho e da Mao  21042
4  2000   S60:Traum Superf do Punho e da Mao   9811

#limpar caracter '-' da coluna ano e converter seu tipo para numérico
#retirar última linha, que possui caracter "-"

In [6]:
df_original.info()
df_original['ano'] = df_original['ano'].apply(pd.to_numeric)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39558 entries, 0 to 49732
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ano     39558 non-null  object
 1   cid     39558 non-null  object
 2   qtde    39558 non-null  object
dtypes: object(3)
memory usage: 1.2+ MB

In [7]:
df_original.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39558 entries, 0 to 49732
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ano     39558 non-null  int64
 1   cid     39558 non-null  object
 2   qtde    39558 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.2+ MB

In [8]:
selecao2016 = df_original['ano'] >= 2016
df_original = df_original[selecao2016]
df_original.shape[0] # 7477

7477

In [9]:
df_original.head()

        ano           cid qtde
40526  2016  999:Ignorado    8
40527  2016  999:Ignorado   65
40528  2016  999:Ignorado    4
40529  2016  999:Ignorado    1
40530  2016  999:Ignorado    4

In [10]:
#excluir os registros cujo cid foi preenchido com '999:Ignorado'
selecaoIgnorado = df_original['cid'] != '999:Ignorado'
df_original = df_original[selecaoIgnorado]
df_original.shape[0] # 7461

7461

In [11]:
df_original.head()

        ano                                 cid qtde
40532  2016                          A00:Colera    1
40533  2016    A01:Febres Tifoide e Paratifoide    1
40534  2016        A02:Outr Infecc p/Salmonella    1
40535  2016  A04:Outr Infecc Intestinais Bacter   12
40536  2016   A05:Outr Intox Alimentares Bacter   17

In [12]:
df_original['cid'] = df_original['cid'].apply(lambda x: recortarCID(x))
df_original.index = range(df_original.shape[0])
df_original.index.name='id'
df_original.head(10)

     ano  cid qtde
id
0   2016  A00    1
1   2016  A01    1
2   2016  A02    1
3   2016  A04   12
4   2016  A05   17
5   2016  A06    4
6   2016  A06    1
7   2016  A06    1
8   2016  A07    2
9   2016  A08    2

In [18]:
df_original.to_csv(nomeArquivoResultadoCID, sep = ';', encoding='UTF-8')